# Redis keys
KEY_BED_CACHE = "beds_summary_cache"
KEY_BED_CONFIG = "beds_config_fixed_wards"

# Default configuration
DEFAULT_CONFIG = {
    "wards": {
        "ห้องคลอด": 6,
        "หอผู้ป่วยวิกฤตทารกแรกเกิด": 3,
        "หลังคลอด": 16,
        "ผู้ป่วยเด็ก": 20,
        "ผู้ป่วยศัลยชาย": 22,
        "ผู้ป่วยศัลยหญิง": 20,
        "ผู้ป่วยอายุรกรรมชาย": 30,
        "ผู้ป่วยอายุรกรรมหญิง": 30,
        "ผู้ป่วยพิเศษอาคารอ่าวอุดม ชั้น 4": 12,
        "มินิธัญญารักษ์": 6,
        "หน่วยไตเทียม": 8,
        "ER Observ": 8,
        "หอผู้ป่วย ICU": 10,
        "ODS ward": 6


    },
    "allowed_wards": [
        "หลังคลอด",
        "ผู้ป่วยเด็ก",
        "ผู้ป่วยศัลยชาย",
        "ผู้ป่วยศัลยหญิง",
        "ผู้ป่วยอายุรกรรมชาย",
        "ผู้ป่วยอายุรกรรมหญิง",
        "ผู้ป่วยพิเศษอาคารอ่าวอุดม ชั้น 4",
        "มินิธัญญารักษ์"
    ],
    "total_beds": 150
}
